spring-ws-security/src/test/resources/org/springframework/ws/soap/security/wss4j2/expiredTimestamp-soap.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
<SOAP-ENV:Header>
    <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" SOAP-ENV:mustUnderstand="1">
	    <wsu:Timestamp xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="Timestamp-27">
	        <wsu:Created>2009-12-25T15:43:22.687Z</wsu:Created>
	        <wsu:Expires>2009-12-25T15:48:22.687Z</wsu:Expires>
	    </wsu:Timestamp>
	</wsse:Security>
</SOAP-ENV:Header>
<SOAP-ENV:Body>
    <tru:StockSymbol xmlns:tru="http://fabrikam123.com/payloads">QQQ</tru:StockSymbol>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>